import * as React from "react";

/**
 * 初期化前であることを判定するための、空の内部専用ユニークオブジェクトです。
 */
const nil = {};

/**
 * コンポーネントのライフサイクルにおいて、渡されたファクトリー関数を最初のレンダリングのときに一度だけ実行し、その結果を以降の再レンダリング間で共有し、保持するためのカスタムフックです。
 *
 * `React.useMemo` と異なり、React の内部都合によるキャッシュの予期しない破棄、再計算が発生しないことが保証されます。
 *
 * @template T ファクトリー関数が生成するオブジェクトの型定義です。
 * @param fn 初回レンダリングのときにのみ呼び出される、オブジェクト生成用の初期化関数です。
 * @returns 初回実行したときに生成され、保持されている型 `T` のシングルトンインスタンスを返します。
 */
export default function useSingleton<T>(fn: () => T): T {
  // 生成されたオブジェクトをコンポーネントの生存期間中保持するために `useRef` を使用します。
  // 初期値として、未初期化の目印である `nil` オブジェクトを型アサーションして設定します。
  const ref = React.useRef<T>(nil as T);

  // 参照している中身が `nil` と同一のオブジェクトのままであれば、一度も初期化されていないと判定します。
  if (ref.current === nil) {
    // 初期化関数を実行し、生成された実体を現在の参照に上書きします。
    // この処理は初回のレンダリング中に同期的に実行されます。
    ref.current = fn();
  }

  return ref.current;
}
